// See https://aka.ms/new-console-template for more information
using Seminar2._1;

/*
Мы пишем простое чат-приложение способное передавать сообщения с 
компьютера на компьютер. Начнем с разработки модели сообщений для 
нашего чата. Договоримся что у каждого пользователя может быть свой 
ник-нейм - уникальное имя. Ему можно будет передать сообщение, состоящее 
из даты, никнейма отправителя  и текста сообщения. Как мог бы выглядеть 
класс представляющий сообщение в этом случае.
*/

Server.Start("Alex");
