using Seminar_2;

internal class Program
{
    /*
     * Дан список целых чисел (числа не последовательны), в котором некоторые числа повторяются.  
     * Выведите список чисел на экран, исключив из него повторы.
     * */
    private static void Main(string[] args)
    {
        //new Task1().Solution();
        //new Task2().Solution();
        Console.WriteLine(new Task3().HasExix(3, 6));

    }
}