internal class Program
{
    //Напишите утилиту которая ищет
    //файлы определенного расширения с указанным текстом. Рекурсивно.
    //Пример вызова утилиты: utility.exe txt текст.
    private static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}